{"format": "layers-model", "generatedBy": "keras v2.4.0", "convertedBy": "TensorFlow.js Converter v3.13.0", "modelTopology": {"keras_version": "2.4.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "functional_1", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 128], "dtype": "int32", "sparse": false, "ragged": false, "name": "input_ids"}, "name": "input_ids", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 128], "dtype": "int32", "sparse": false, "ragged": false, "name": "attention_mask"}, "name": "attention_mask", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 128], "dtype": "int32", "sparse": false, "ragged": false, "name": "token_type_ids"}, "name": "token_type_ids", "inbound_nodes": []}, {"class_name": "TFBertModel", "config": {"return_dict": true, "output_hidden_states": false, "output_attentions": false, "torchscript": false, "torch_dtype": null, "use_bfloat16": false, "pruned_heads": {}, "tie_word_embeddings": true, "is_encoder_decoder": false, "is_decoder": false, "cross_attention_hidden_size": null, "add_cross_attention": false, "tie_encoder_decoder": false, "max_length": 20, "min_length": 0, "do_sample": false, "early_stopping": false, "num_beams": 1, "num_beam_groups": 1, "diversity_penalty": 0.0, "temperature": 1.0, "top_k": 50, "top_p": 1.0, "repetition_penalty": 1.0, "length_penalty": 1.0, "no_repeat_ngram_size": 0, "encoder_no_repeat_ngram_size": 0, "bad_words_ids": null, "num_return_sequences": 1, "chunk_size_feed_forward": 0, "output_scores": false, "return_dict_in_generate": false, "forced_bos_token_id": null, "forced_eos_token_id": null, "remove_invalid_values": false, "architectures": null, "finetuning_task": null, "id2label": {"0": "LABEL_0", "1": "LABEL_1"}, "label2id": {"LABEL_0": 0, "LABEL_1": 1}, "tokenizer_class": null, "prefix": null, "bos_token_id": null, "pad_token_id": 0, "eos_token_id": null, "sep_token_id": null, "decoder_start_token_id": null, "task_specific_params": null, "problem_type": null, "_name_or_path": "google/bert_uncased_L-2_H-128_A-2", "transformers_version": "4.16.2", "model_type": "bert", "vocab_size": 30522, "hidden_size": 128, "num_hidden_layers": 2, "num_attention_heads": 2, "hidden_act": "gelu", "intermediate_size": 512, "hidden_dropout_prob": 0.1, "attention_probs_dropout_prob": 0.1, "max_position_embeddings": 512, "type_vocab_size": 2, "initializer_range": 0.02, "layer_norm_eps": 1e-12, "position_embedding_type": "absolute", "use_cache": true, "classifier_dropout": null}, "name": "tf_bert_model", "inbound_nodes": [[["input_ids", 0, 0, {"token_type_ids": ["token_type_ids", 0, 0], "attention_mask": ["attention_mask", 0, 0]}]]]}, {"class_name": "Flatten", "config": {"name": "flatten", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten", "inbound_nodes": [[["tf_bert_model", 0, 0, {}]]]}], "input_layers": [["input_ids", 0, 0], ["token_type_ids", 0, 0], ["attention_mask", 0, 0]], "output_layers": [["flatten", 0, 0]]}}, "training_config": {"loss": [{"class_name": "BinaryCrossentropy", "config": {"reduction": "auto", "name": "binary_crossentropy", "from_logits": false, "label_smoothing": 0}}], "metrics": ["accuracy"], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 0.0001, "decay": 0.0, "beta_1": 0.9, "beta_2": 0.999, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of5.bin", "group1-shard2of5.bin", "group1-shard3of5.bin", "group1-shard4of5.bin", "group1-shard5of5.bin"], "weights": [{"name": "tf_bert_model/bert/embeddings/word_embeddings/weight", "shape": [30522, 128], "dtype": "float32"}, {"name": "tf_bert_model/bert/embeddings/token_type_embeddings/embeddings", "shape": [2, 128], "dtype": "float32"}, {"name": "tf_bert_model/bert/embeddings/position_embeddings/embeddings", "shape": [512, 128], "dtype": "float32"}, {"name": "tf_bert_model/bert/embeddings/LayerNorm/gamma", "shape": [128], "dtype": "float32"}, {"name": "tf_bert_model/bert/embeddings/LayerNorm/beta", "shape": [128], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._0/attention/self/query/kernel", "shape": [128, 128], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._0/attention/self/query/bias", "shape": [128], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._0/attention/self/key/kernel", "shape": [128, 128], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._0/attention/self/key/bias", "shape": [128], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._0/attention/self/value/kernel", "shape": [128, 128], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._0/attention/self/value/bias", "shape": [128], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._0/attention/output/dense/kernel", "shape": [128, 128], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._0/attention/output/dense/bias", "shape": [128], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._0/attention/output/LayerNorm/gamma", "shape": [128], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._0/attention/output/LayerNorm/beta", "shape": [128], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._0/intermediate/dense/kernel", "shape": [128, 512], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._0/intermediate/dense/bias", "shape": [512], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._0/output/dense/kernel", "shape": [512, 128], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._0/output/dense/bias", "shape": [128], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._0/output/LayerNorm/gamma", "shape": [128], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._0/output/LayerNorm/beta", "shape": [128], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._1/attention/self/query/kernel", "shape": [128, 128], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._1/attention/self/query/bias", "shape": [128], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._1/attention/self/key/kernel", "shape": [128, 128], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._1/attention/self/key/bias", "shape": [128], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._1/attention/self/value/kernel", "shape": [128, 128], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._1/attention/self/value/bias", "shape": [128], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._1/attention/output/dense/kernel", "shape": [128, 128], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._1/attention/output/dense/bias", "shape": [128], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._1/attention/output/LayerNorm/gamma", "shape": [128], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._1/attention/output/LayerNorm/beta", "shape": [128], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._1/intermediate/dense/kernel", "shape": [128, 512], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._1/intermediate/dense/bias", "shape": [512], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._1/output/dense/kernel", "shape": [512, 128], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._1/output/dense/bias", "shape": [128], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._1/output/LayerNorm/gamma", "shape": [128], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._1/output/LayerNorm/beta", "shape": [128], "dtype": "float32"}, {"name": "tf_bert_model/bert/pooler/dense/kernel", "shape": [128, 128], "dtype": "float32"}, {"name": "tf_bert_model/bert/pooler/dense/bias", "shape": [128], "dtype": "float32"}]}]}