{"format": "layers-model", "generatedBy": "keras v2.4.0", "convertedBy": "TensorFlow.js Converter v3.13.0", "modelTopology": {"keras_version": "2.4.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "functional_1", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 11], "dtype": "int32", "sparse": false, "ragged": false, "name": "input_ids"}, "name": "input_ids", "inbound_nodes": []}, {"class_name": "BertModelLayer", "config": {"name": "bert", "trainable": true, "dtype": "float32", "initializer_range": 0.02, "max_position_embeddings": 512, "hidden_size": 768, "embedding_size": null, "project_embeddings_with_bias": true, "vocab_size": 30522, "use_token_type": true, "use_position_embeddings": true, "token_type_vocab_size": 2, "hidden_dropout": 0.1, "extra_tokens_vocab_size": null, "project_position_embeddings": true, "mask_zero": false, "adapter_size": null, "adapter_activation": "gelu", "adapter_init_scale": 0.001, "num_heads": 12, "size_per_head": null, "query_activation": null, "key_activation": null, "value_activation": null, "attention_dropout": 0.1, "negative_infinity": -10000.0, "intermediate_size": 3072, "intermediate_activation": "gelu", "num_layers": 12, "out_layer_ndxs": null, "shared_layer": false}, "name": "bert", "inbound_nodes": [[["input_ids", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAUAAABTAAAAcxYAAAB8AGQAZACFAmQBZABkAIUCZgMZAFMAKQJO6QAAAACp\nACkB2gNzZXFyAgAAAHICAAAA+gdtYWluLnB52gg8bGFtYmRhPl8AAADzAAAAAA==\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda", "inbound_nodes": [[["bert", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}, "name": "dropout", "inbound_nodes": [[["lambda", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 768, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense", "inbound_nodes": [[["dropout", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}, "name": "dropout_1", "inbound_nodes": [[["dense", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 3, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_1", "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}], "input_layers": [["input_ids", 0, 0]], "output_layers": [["dense_1", 0, 0]]}}, "training_config": {"loss": {"class_name": "SparseCategoricalCrossentropy", "config": {"reduction": "auto", "name": "sparse_categorical_crossentropy", "from_logits": true}}, "metrics": [{"class_name": "SparseCategoricalAccuracy", "config": {"name": "acc", "dtype": "float32"}}], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 4.999999873689376e-05, "decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of105.bin", "group1-shard2of105.bin", "group1-shard3of105.bin", "group1-shard4of105.bin", "group1-shard5of105.bin", "group1-shard6of105.bin", "group1-shard7of105.bin", "group1-shard8of105.bin", "group1-shard9of105.bin", "group1-shard10of105.bin", "group1-shard11of105.bin", "group1-shard12of105.bin", "group1-shard13of105.bin", "group1-shard14of105.bin", "group1-shard15of105.bin", "group1-shard16of105.bin", "group1-shard17of105.bin", "group1-shard18of105.bin", "group1-shard19of105.bin", "group1-shard20of105.bin", "group1-shard21of105.bin", "group1-shard22of105.bin", "group1-shard23of105.bin", "group1-shard24of105.bin", "group1-shard25of105.bin", "group1-shard26of105.bin", "group1-shard27of105.bin", "group1-shard28of105.bin", "group1-shard29of105.bin", "group1-shard30of105.bin", "group1-shard31of105.bin", "group1-shard32of105.bin", "group1-shard33of105.bin", "group1-shard34of105.bin", "group1-shard35of105.bin", "group1-shard36of105.bin", "group1-shard37of105.bin", "group1-shard38of105.bin", "group1-shard39of105.bin", "group1-shard40of105.bin", "group1-shard41of105.bin", "group1-shard42of105.bin", "group1-shard43of105.bin", "group1-shard44of105.bin", "group1-shard45of105.bin", "group1-shard46of105.bin", "group1-shard47of105.bin", "group1-shard48of105.bin", "group1-shard49of105.bin", "group1-shard50of105.bin", "group1-shard51of105.bin", "group1-shard52of105.bin", "group1-shard53of105.bin", "group1-shard54of105.bin", "group1-shard55of105.bin", "group1-shard56of105.bin", "group1-shard57of105.bin", "group1-shard58of105.bin", "group1-shard59of105.bin", "group1-shard60of105.bin", "group1-shard61of105.bin", "group1-shard62of105.bin", "group1-shard63of105.bin", "group1-shard64of105.bin", "group1-shard65of105.bin", "group1-shard66of105.bin", "group1-shard67of105.bin", "group1-shard68of105.bin", "group1-shard69of105.bin", "group1-shard70of105.bin", "group1-shard71of105.bin", "group1-shard72of105.bin", "group1-shard73of105.bin", "group1-shard74of105.bin", "group1-shard75of105.bin", "group1-shard76of105.bin", "group1-shard77of105.bin", "group1-shard78of105.bin", "group1-shard79of105.bin", "group1-shard80of105.bin", "group1-shard81of105.bin", "group1-shard82of105.bin", "group1-shard83of105.bin", "group1-shard84of105.bin", "group1-shard85of105.bin", "group1-shard86of105.bin", "group1-shard87of105.bin", "group1-shard88of105.bin", "group1-shard89of105.bin", "group1-shard90of105.bin", "group1-shard91of105.bin", "group1-shard92of105.bin", "group1-shard93of105.bin", "group1-shard94of105.bin", "group1-shard95of105.bin", "group1-shard96of105.bin", "group1-shard97of105.bin", "group1-shard98of105.bin", "group1-shard99of105.bin", "group1-shard100of105.bin", "group1-shard101of105.bin", "group1-shard102of105.bin", "group1-shard103of105.bin", "group1-shard104of105.bin", "group1-shard105of105.bin"], "weights": [{"name": "bert/embeddings/word_embeddings/embeddings", "shape": [30522, 768], "dtype": "float32"}, {"name": "bert/embeddings/position_embeddings/embeddings", "shape": [512, 768], "dtype": "float32"}, {"name": "bert/embeddings/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "bert/embeddings/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "bert/encoder/layer_0/attention/self/query/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "bert/encoder/layer_0/attention/self/query/bias", "shape": [768], "dtype": "float32"}, {"name": "bert/encoder/layer_0/attention/self/key/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "bert/encoder/layer_0/attention/self/key/bias", "shape": [768], "dtype": "float32"}, {"name": "bert/encoder/layer_0/attention/self/value/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "bert/encoder/layer_0/attention/self/value/bias", "shape": [768], "dtype": "float32"}, {"name": "bert/encoder/layer_0/attention/output/dense/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "bert/encoder/layer_0/attention/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "bert/encoder/layer_0/attention/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "bert/encoder/layer_0/attention/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "bert/encoder/layer_0/intermediate/kernel", "shape": [768, 3072], "dtype": "float32"}, {"name": "bert/encoder/layer_0/intermediate/bias", "shape": [3072], "dtype": "float32"}, {"name": "bert/encoder/layer_0/output/dense/kernel", "shape": [3072, 768], "dtype": "float32"}, {"name": "bert/encoder/layer_0/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "bert/encoder/layer_0/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "bert/encoder/layer_0/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "bert/encoder/layer_1/attention/self/query/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "bert/encoder/layer_1/attention/self/query/bias", "shape": [768], "dtype": "float32"}, {"name": "bert/encoder/layer_1/attention/self/key/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "bert/encoder/layer_1/attention/self/key/bias", "shape": [768], "dtype": "float32"}, {"name": "bert/encoder/layer_1/attention/self/value/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "bert/encoder/layer_1/attention/self/value/bias", "shape": [768], "dtype": "float32"}, {"name": "bert/encoder/layer_1/attention/output/dense/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "bert/encoder/layer_1/attention/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "bert/encoder/layer_1/attention/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "bert/encoder/layer_1/attention/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "bert/encoder/layer_1/intermediate/kernel", "shape": [768, 3072], "dtype": "float32"}, {"name": "bert/encoder/layer_1/intermediate/bias", "shape": [3072], "dtype": "float32"}, {"name": "bert/encoder/layer_1/output/dense/kernel", "shape": [3072, 768], "dtype": "float32"}, {"name": "bert/encoder/layer_1/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "bert/encoder/layer_1/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "bert/encoder/layer_1/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "bert/encoder/layer_2/attention/self/query/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "bert/encoder/layer_2/attention/self/query/bias", "shape": [768], "dtype": "float32"}, {"name": "bert/encoder/layer_2/attention/self/key/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "bert/encoder/layer_2/attention/self/key/bias", "shape": [768], "dtype": "float32"}, {"name": "bert/encoder/layer_2/attention/self/value/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "bert/encoder/layer_2/attention/self/value/bias", "shape": [768], "dtype": "float32"}, {"name": "bert/encoder/layer_2/attention/output/dense/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "bert/encoder/layer_2/attention/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "bert/encoder/layer_2/attention/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "bert/encoder/layer_2/attention/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "bert/encoder/layer_2/intermediate/kernel", "shape": [768, 3072], "dtype": "float32"}, {"name": "bert/encoder/layer_2/intermediate/bias", "shape": [3072], "dtype": "float32"}, {"name": "bert/encoder/layer_2/output/dense/kernel", "shape": [3072, 768], "dtype": "float32"}, {"name": "bert/encoder/layer_2/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "bert/encoder/layer_2/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "bert/encoder/layer_2/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "bert/encoder/layer_3/attention/self/query/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "bert/encoder/layer_3/attention/self/query/bias", "shape": [768], "dtype": "float32"}, {"name": "bert/encoder/layer_3/attention/self/key/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "bert/encoder/layer_3/attention/self/key/bias", "shape": [768], "dtype": "float32"}, {"name": "bert/encoder/layer_3/attention/self/value/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "bert/encoder/layer_3/attention/self/value/bias", "shape": [768], "dtype": "float32"}, {"name": "bert/encoder/layer_3/attention/output/dense/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "bert/encoder/layer_3/attention/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "bert/encoder/layer_3/attention/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "bert/encoder/layer_3/attention/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "bert/encoder/layer_3/intermediate/kernel", "shape": [768, 3072], "dtype": "float32"}, {"name": "bert/encoder/layer_3/intermediate/bias", "shape": [3072], "dtype": "float32"}, {"name": "bert/encoder/layer_3/output/dense/kernel", "shape": [3072, 768], "dtype": "float32"}, {"name": "bert/encoder/layer_3/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "bert/encoder/layer_3/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "bert/encoder/layer_3/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "bert/encoder/layer_4/attention/self/query/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "bert/encoder/layer_4/attention/self/query/bias", "shape": [768], "dtype": "float32"}, {"name": "bert/encoder/layer_4/attention/self/key/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "bert/encoder/layer_4/attention/self/key/bias", "shape": [768], "dtype": "float32"}, {"name": "bert/encoder/layer_4/attention/self/value/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "bert/encoder/layer_4/attention/self/value/bias", "shape": [768], "dtype": "float32"}, {"name": "bert/encoder/layer_4/attention/output/dense/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "bert/encoder/layer_4/attention/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "bert/encoder/layer_4/attention/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "bert/encoder/layer_4/attention/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "bert/encoder/layer_4/intermediate/kernel", "shape": [768, 3072], "dtype": "float32"}, {"name": "bert/encoder/layer_4/intermediate/bias", "shape": [3072], "dtype": "float32"}, {"name": "bert/encoder/layer_4/output/dense/kernel", "shape": [3072, 768], "dtype": "float32"}, {"name": "bert/encoder/layer_4/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "bert/encoder/layer_4/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "bert/encoder/layer_4/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "bert/encoder/layer_5/attention/self/query/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "bert/encoder/layer_5/attention/self/query/bias", "shape": [768], "dtype": "float32"}, {"name": "bert/encoder/layer_5/attention/self/key/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "bert/encoder/layer_5/attention/self/key/bias", "shape": [768], "dtype": "float32"}, {"name": "bert/encoder/layer_5/attention/self/value/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "bert/encoder/layer_5/attention/self/value/bias", "shape": [768], "dtype": "float32"}, {"name": "bert/encoder/layer_5/attention/output/dense/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "bert/encoder/layer_5/attention/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "bert/encoder/layer_5/attention/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "bert/encoder/layer_5/attention/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "bert/encoder/layer_5/intermediate/kernel", "shape": [768, 3072], "dtype": "float32"}, {"name": "bert/encoder/layer_5/intermediate/bias", "shape": [3072], "dtype": "float32"}, {"name": "bert/encoder/layer_5/output/dense/kernel", "shape": [3072, 768], "dtype": "float32"}, {"name": "bert/encoder/layer_5/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "bert/encoder/layer_5/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "bert/encoder/layer_5/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "bert/encoder/layer_6/attention/self/query/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "bert/encoder/layer_6/attention/self/query/bias", "shape": [768], "dtype": "float32"}, {"name": "bert/encoder/layer_6/attention/self/key/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "bert/encoder/layer_6/attention/self/key/bias", "shape": [768], "dtype": "float32"}, {"name": "bert/encoder/layer_6/attention/self/value/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "bert/encoder/layer_6/attention/self/value/bias", "shape": [768], "dtype": "float32"}, {"name": "bert/encoder/layer_6/attention/output/dense/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "bert/encoder/layer_6/attention/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "bert/encoder/layer_6/attention/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "bert/encoder/layer_6/attention/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "bert/encoder/layer_6/intermediate/kernel", "shape": [768, 3072], "dtype": "float32"}, {"name": "bert/encoder/layer_6/intermediate/bias", "shape": [3072], "dtype": "float32"}, {"name": "bert/encoder/layer_6/output/dense/kernel", "shape": [3072, 768], "dtype": "float32"}, {"name": "bert/encoder/layer_6/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "bert/encoder/layer_6/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "bert/encoder/layer_6/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "bert/encoder/layer_7/attention/self/query/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "bert/encoder/layer_7/attention/self/query/bias", "shape": [768], "dtype": "float32"}, {"name": "bert/encoder/layer_7/attention/self/key/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "bert/encoder/layer_7/attention/self/key/bias", "shape": [768], "dtype": "float32"}, {"name": "bert/encoder/layer_7/attention/self/value/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "bert/encoder/layer_7/attention/self/value/bias", "shape": [768], "dtype": "float32"}, {"name": "bert/encoder/layer_7/attention/output/dense/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "bert/encoder/layer_7/attention/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "bert/encoder/layer_7/attention/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "bert/encoder/layer_7/attention/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "bert/encoder/layer_7/intermediate/kernel", "shape": [768, 3072], "dtype": "float32"}, {"name": "bert/encoder/layer_7/intermediate/bias", "shape": [3072], "dtype": "float32"}, {"name": "bert/encoder/layer_7/output/dense/kernel", "shape": [3072, 768], "dtype": "float32"}, {"name": "bert/encoder/layer_7/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "bert/encoder/layer_7/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "bert/encoder/layer_7/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "bert/encoder/layer_8/attention/self/query/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "bert/encoder/layer_8/attention/self/query/bias", "shape": [768], "dtype": "float32"}, {"name": "bert/encoder/layer_8/attention/self/key/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "bert/encoder/layer_8/attention/self/key/bias", "shape": [768], "dtype": "float32"}, {"name": "bert/encoder/layer_8/attention/self/value/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "bert/encoder/layer_8/attention/self/value/bias", "shape": [768], "dtype": "float32"}, {"name": "bert/encoder/layer_8/attention/output/dense/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "bert/encoder/layer_8/attention/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "bert/encoder/layer_8/attention/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "bert/encoder/layer_8/attention/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "bert/encoder/layer_8/intermediate/kernel", "shape": [768, 3072], "dtype": "float32"}, {"name": "bert/encoder/layer_8/intermediate/bias", "shape": [3072], "dtype": "float32"}, {"name": "bert/encoder/layer_8/output/dense/kernel", "shape": [3072, 768], "dtype": "float32"}, {"name": "bert/encoder/layer_8/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "bert/encoder/layer_8/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "bert/encoder/layer_8/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "bert/encoder/layer_9/attention/self/query/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "bert/encoder/layer_9/attention/self/query/bias", "shape": [768], "dtype": "float32"}, {"name": "bert/encoder/layer_9/attention/self/key/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "bert/encoder/layer_9/attention/self/key/bias", "shape": [768], "dtype": "float32"}, {"name": "bert/encoder/layer_9/attention/self/value/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "bert/encoder/layer_9/attention/self/value/bias", "shape": [768], "dtype": "float32"}, {"name": "bert/encoder/layer_9/attention/output/dense/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "bert/encoder/layer_9/attention/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "bert/encoder/layer_9/attention/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "bert/encoder/layer_9/attention/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "bert/encoder/layer_9/intermediate/kernel", "shape": [768, 3072], "dtype": "float32"}, {"name": "bert/encoder/layer_9/intermediate/bias", "shape": [3072], "dtype": "float32"}, {"name": "bert/encoder/layer_9/output/dense/kernel", "shape": [3072, 768], "dtype": "float32"}, {"name": "bert/encoder/layer_9/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "bert/encoder/layer_9/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "bert/encoder/layer_9/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "bert/encoder/layer_10/attention/self/query/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "bert/encoder/layer_10/attention/self/query/bias", "shape": [768], "dtype": "float32"}, {"name": "bert/encoder/layer_10/attention/self/key/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "bert/encoder/layer_10/attention/self/key/bias", "shape": [768], "dtype": "float32"}, {"name": "bert/encoder/layer_10/attention/self/value/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "bert/encoder/layer_10/attention/self/value/bias", "shape": [768], "dtype": "float32"}, {"name": "bert/encoder/layer_10/attention/output/dense/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "bert/encoder/layer_10/attention/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "bert/encoder/layer_10/attention/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "bert/encoder/layer_10/attention/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "bert/encoder/layer_10/intermediate/kernel", "shape": [768, 3072], "dtype": "float32"}, {"name": "bert/encoder/layer_10/intermediate/bias", "shape": [3072], "dtype": "float32"}, {"name": "bert/encoder/layer_10/output/dense/kernel", "shape": [3072, 768], "dtype": "float32"}, {"name": "bert/encoder/layer_10/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "bert/encoder/layer_10/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "bert/encoder/layer_10/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "bert/encoder/layer_11/attention/self/query/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "bert/encoder/layer_11/attention/self/query/bias", "shape": [768], "dtype": "float32"}, {"name": "bert/encoder/layer_11/attention/self/key/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "bert/encoder/layer_11/attention/self/key/bias", "shape": [768], "dtype": "float32"}, {"name": "bert/encoder/layer_11/attention/self/value/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "bert/encoder/layer_11/attention/self/value/bias", "shape": [768], "dtype": "float32"}, {"name": "bert/encoder/layer_11/attention/output/dense/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "bert/encoder/layer_11/attention/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "bert/encoder/layer_11/attention/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "bert/encoder/layer_11/attention/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "bert/encoder/layer_11/intermediate/kernel", "shape": [768, 3072], "dtype": "float32"}, {"name": "bert/encoder/layer_11/intermediate/bias", "shape": [3072], "dtype": "float32"}, {"name": "bert/encoder/layer_11/output/dense/kernel", "shape": [3072, 768], "dtype": "float32"}, {"name": "bert/encoder/layer_11/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "bert/encoder/layer_11/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "bert/encoder/layer_11/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "dense/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "dense/bias", "shape": [768], "dtype": "float32"}, {"name": "dense_1/kernel", "shape": [768, 3], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [3], "dtype": "float32"}]}]}